app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def all_posts
    @post = Post.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 8], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @post = @user.posts.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "raining"], ["content", "tap tap tap "], ["user_id", 2], ["created_at", "2023-12-07 10:33:12.647844"], ["updated_at", "2023-12-07 10:33:12.647844"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def create
    @user = User.find(params[:user_id])
    return render json: {message: "user should be present but no user found"} if @user == nil #if there is no user then display message
    post = @user.posts.build(post_params)
    if post.save
      render json: {message: "post created successfully created by #{@user.name} and post id #{post.id}"}
    else
      render json: { error: post.errors.full_messages.join(', ') }, status: :unprocessable_entity

UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "greenery"], ["content", "fejhfjrf ff f rfhhhhhhhhhhhhfrfg grg rgrg "], ["updated_at", "2023-12-07 12:46:19.320824"], ["id", 11]]
---
  def update
    if @post.update(post_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def set_user_to_post
    begin
      @user = User.find(params[:user_id])
      @post = @user.posts.find(params[:id])