app/controllers/posts_controller.rb

  def index
    @post = $user.posts.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]

  def create
    return render json: {message: "user should be present but no user found"} if $user == nil #if there is no user then display message
    post = $user.posts.build(post_params)
    if post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "greenery"], ["content", "fejhfjrf ff f rff rfrf rfrfrf rfrfg grg rgrg "], ["user_id", 2], ["created_at", "2023-12-07 09:12:24.585194"], ["updated_at", "2023-12-07 09:12:24.585194"]]