app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      render json: { message: 'User successfully created' }, status: :created
    else
      render json: { error: @user.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
INSERT INTO "users" ("name", "username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "text"], ["username", "text535"], ["email", "text@test.com"], ["password", "[FILTERED]"], ["created_at", "2023-12-07 11:00:17.705620"], ["updated_at", "2023-12-07 11:00:17.705620"]]
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]

  def login
    if @user.present?
      render json: {message: "first do logout"}
    else
      @user = User.find_by(email: params[:email]) || User.find_by(username: params[:username])
      if @user && @user.authenticate(params[:password])
        @token = User.generate_token(@user)
        @user.update(token:@token)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "511"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-12-11 12:41:15.450137"], ["token", "[FILTERED]"], ["id", 1]]

  def update
    return render json:{message: "user not logged in"} if @user.token == nil
    if @user.update(user_params)
      render json: { message: 'User details updated successfully' }
    else
      render json: { error: @user.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "323511"], ["email", "akash@test.com"], ["updated_at", "2023-12-07 11:35:07.225566"], ["id", 2]]
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]

  def remove_account
    if @user
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]

  def set_user
    begin
      @user  =  User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]