app/controllers/users_controller.rb

  def remove_account
    if $user
      $user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]